float AKHBT(int KC, float PSIBD, int KH)
//   KH = 1 - пpиpабатывается, KH = 2 - не пpиpабатывается
{
    float AB[2][14] = { .33, .78, .3, .83, .217, .417, .167, .583, .098,
                    .267, .0521, .111, .05, .167, .05, .111, .0433, .113, .0333, .077,
                    .0153, .0388, .0347, .0812, .00586, .0304, .0246, .0396 };
    int j = (KC - 1) * 2 + 1;
    float AKHBT = 1. + AB[KH - 1][j - 1] * PSIBD + AB[KH - 1][j] * (PSIBD * PSIBD);
    return AKHBT;
}

/*
        FUNCTION AKHBT(KC,PSIBD,KH)
C   KH=1 -пpиpабатывается, KH=2 -не пpиpабатывается
        DIMENSION AB(2,14)
    SAVE
        DATA AB/.33,.78,.3,.83,.217,.417,.167,.583,.098,
     * .267,.0521,.111,.05,.167,.05,.111,.0433,.113,.0333,.077,
     * .0153,.0388,.0347,.0812,.00586,.0304,.0246,.0396/
        J=(KC-1)*2+1
        AKHBT=1.+AB(KH,J)*PSIBD+AB(KH,J+1)*(PSIBD**2)
        RETURN
        END
*/