// =====+= оЕВЮРЭ ДНОНКМХРЕКЭМШУ ЦЕНЛЕРПХВЕЯЙХУ Х ЙХМЕЛЮРХВЕЯЙХУ ОЮПЮЛЕРПНБ =================

#include <iostream>
using namespace std;

extern float Z1, Z2;                        // ВХЯКЮ ГСАЭЕБ ЬЕЯРЕПМХ Х ЙНКЕЯЮ
extern float MN, BE, X1, X2, X[2];          // ЛНДСКЭ, СЦНК МЮЙКНМЮ, ЙНЩТТХЖХЕМРШ ЯЛЕЫЕМХЪ

extern fstream f_1;    // ТЮИК ДКЪ ПЕГСКЭРЮРЮ    //***

void DGKP(int I12, float DB[2], float BETB, float DP[2], float ROP[2], float DL[2], float ROL[2], float DELZV, float DG[2], float ROG[2], float DU[2], float DV[2],
          float RLM, float RLMIN, float RKEPS, float PALF, float PX, float SNA[2], float TETP[2], float TETV[2], float DZTP[2], float DZTV[2]) 
{
    f_1 << "\nднонкмхрекэмше ценлерпхвеяйхе х ";
    f_1 << "\nйхмелюрхвеяйхе оюпюлерпш ";

    if (I12 == 0)     f_1 << "\n                                              ьеярепмъ  йнкеян ";   // ПЕДСЙРНП
             else f_1 << "\n                                              йнкеян  ьеярепмъ ";   // ЛСКЭРХОКХЙЮРНП

    f_1 << "\n нямнбмше дхюлерпш                    DB   " << setw(10) << DB[0] << setw(10) << DB[1];
    f_1 << "\n дхюлерпш нйпсфмняреи мхфмху";
    f_1 << "\n юйрхбмшу рнвей опнтхкъ               DP   " << setw(10) << DP[0] << setw(10) << DP[1];
    f_1 << "\n пюдхсяш йпхбхгмш юйрхбмнцн";
    f_1 << "\n опнтхкъ гсаю б мхфмеи рнвйе          ROP  " << setw(10) << ROP[0] << setw(10) << ROP[1];

    f_1 << "\n дхюлерпш нйпсфмняреи цпюмхвмшу";
    f_1 << "\n рнвей опнтхкъ                        DL   " << setw(10) << DL[0] << setw(10) << DL[1];
    f_1 << "\n пюдхсяш йпхбхгмш опнтхкъ гсаю";
    f_1 << "\n цпюмхвмни рнвйе                      ROL   " << setw(10) << ROL[0] << setw(10) << ROL[1];

    if (DELZV != 0.) {
        f_1 << "\n дхюлерпш нйпсфмняреи лндхтхйюжхх";
        f_1 << "\n цнкнбнй гсаэеб                       DG   " << setw(10) << DG[0] << setw(10) << DG[1];
        f_1 << "\n пюдхсяш йпхбхгмш опнтхкъ гсаю";
        f_1 << "\n б мювюкэмни рнвйе лндхтхйюжхх        ROG   " << setw(10) << ROG[0] << setw(10) << ROG[1];

    }
    if (BE == 0.) {
        f_1 << "\n дхюлерпш нйпсфмняреи бепумху цпюмхв-";
        f_1 << "\n мшу рнвей ндмноюпмнцн гюжеокемхъ     DU   " << setw(10) << DU[0] << setw(10) << DU[1];
        f_1 << "\n дхюлерпш нйпсфмняреи мхфмху цпюмхв-";
        f_1 << "\n мшу рнвей ндмноюпмнцн гюжеокемхъ     DV   " << setw(10) << DV[0] << setw(10) << DV[1];
    }

    f_1 << "\n\n ьюц гюжеокемхъ                     PALF   " << setw(10) << PALF;
            
    ZPRGMS(BETB, GRM, SEC);

    if (BE != 0.) {
        f_1 << "\n\n няебни ьюц                           PX   " << setw(10) << PX;
        f_1 << "\n\n нямнбмни сцнк мюйкнмю кхмхх гсаю   BETB   " << setw(10) << GRM << setw(3) << SEC;
    }
    f_1 << "\n\n йнщттхжхемрш мнплюкэмни рнкыхмш";
    f_1 << "\n гсаю мю онбепумнярх бепьхм          SNA   " << setw(10) << SNA[0] << setw(10) << SNA[1];
    f_1 << "\n сдекэмне яйнкэфемхе б мхфмеи";
    f_1 << "\n рнвйе юйрхбмнцн опнтхкъ             TETP   " << setw(10) << TETP[0] << setw(10) << TETP[1];

    if (BE == 0.) {
        f_1 << "\n\n сдекэмне яйнкэфемхе б мхфмеи цпюмхв-";
        f_1 << "\n мни рнвйе ндмноюпмнцн гюжеокемхъ   TETV   " << setw(10) << TETV[0] << setw(10) << TETV[1];
    }
    if (BE != 0.) {
        f_1 << "\n\n япедмъъ ясллюпмюъ дкхмю";
        f_1 << "\n йнмрюйрмшу кхмхи                     LM   " << setw(10) << RLM;
        f_1 << "\n мюхлемэьюъ ясллюпмюъ дкхмю";
        f_1 << "\n йнмрюйрмшу кхмхи                   LMIN   " << setw(10) << RLMIN;
        f_1 << "\n йнщттхжхемр япедмецн хглемемхъ";
        f_1 << "\n ясллюпмни дкхмш йнмрюйрмшу кхмхи   KEPS   " << setw(10) << RKEPS;
    }

}

/*
CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC
C                   оPOцPAMMA   " DGKP "			C
C            оЕВЮРЭ ДНОНКМХРЕКЭМШУ ЦЕНЛЕРПХВЕЯЙХУ		C
C            Х ЙХМЕЛЮРХВЕЯЙХУ ОЮПЮЛЕРПНБ                        C
CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC
SUBROUTINE DGKP(I12, DB, BET, BETB, DP, ROP, DL, ROL, DELZV, DG, ROG,
    *DU, DV, RLM, RLMIN, RKEPS, PALF, PX, SNA, TETP, TETV, DZTP, DZTV)
    DIMENSION DB(2),
    * DG(2), DL(2), ROL(2), DP(2), ROG(2), ROP(2), DU(2), DV(2),
    * DS(2), ROS(2),
    * TETP(2), TETV(2), DZTP(2), DZTV(2)
    DIMENSION SNA(2)
    WRITE(1, 100)
    100 FORMAT(/
        *11X, 'днонкмхрекэмше ценлерпхвеяйхе х', /
        *11X, 'йхмелюрхвеяйхе оюпюлерпш' / )
    IF(I12.LT.1) THEN
    C I12 = 0 - ПЕДСЙРНП
    WRITE(1, 191)
    191 FORMAT(
        *43X, 'ьеярепмъ  йнкеян')
    ELSE
    C I12 = 1 - ЛСКЭРХОКХЙЮРНП
    WRITE(1, 192)
    192 FORMAT(
        *43X, ' йнкеян  ьеярепмъ')
    END IF
    WRITE(1, 101) DB, DP, ROP
    101 FORMAT(
        *' нямнбмше дхюлерпш                    DB', 2F10.3 /
        *' дхюлерпш нйпсфмняреи мхфмху ' /
        *' юйрхбмшу рнвей опнтхкъ               DP', 2F10.3 /
        *' пюдхсяш йпхбхгмш юйрхбмнцн ' /
        *' опнтхкъ гсаю б мхфмеи рнвйе         ROP', 2F10.3)
    WRITE(1, 102) DL, ROL
    102 FORMAT(
        *' дхюлерпш нйпсфмняреи цпюмхвмшу' /
        *' рнвей опнтхкъ                        DL', 2F10.3 /
        *' пюдхсяш йпхбхгмш опнтхкъ гсаю' /
        *' б цпюмхвмни рнвйе                   ROL', 2F10.3)
    IF(DELZV.NE.0.) WRITE(1, 103) DG, ROG
    103 FORMAT(
        *' дхюлерпш нйпсфмняреи лндхтхйюжхх' /
        *' цнкнбнй гсаэеб                       DG', 2F10.3 /
        *' пюдхсяш йпхбхгмш опнтхкъ гсаю ' /
        *' б мювюкэмни рнвйе лндхтхйюжхх       ROG', 2F10.3)
    IF(BET.EQ.0.) WRITE(1, 104) DU, DV
    104 FORMAT(
        *' дхюлерпш нйпсфмняреи бепумху цпюмхв-' /
        *' мшу рнвей ндмноюпмнцн гюжеокемхъ     DU', 2F10.3 /
        *' дхюлерпш нйпсфмняреи мхфмху цпюмхв-' /
        *' мшу рнвей ндмноюпмнцн гюжеокемхъ     DV', 2F10.3)
    CALL ZPRGMS(BETB, GRM, SEC)
    WRITE(1, 105) PALF
    105 FORMAT(/
        *' ьюц гюжеокемхъ                     PALF', F13.3)
    IF(BET.NE.0.) WRITE(1, 1050) PX, GRM, SEC
    1050 FORMAT(/
        *' няебни ьюц                           PX', F13.3//
        * ' нямнбмни сцнк мюйкнмю кхмхх гсаю   BETB', F12.2, F3.2)
    WRITE(1, 1051) SNA, TETP
    1051 FORMAT(/
        *' йнщттхжхемрш мнплюкэмни рнкыхмш' /
        *' гсаю мю онбепумнярх бепьхм          SNA', 2F10.3//
        * ' сдекэмне яйнкэфемхе б мхфмеи' /
        *' рнвйе юйрхбмнцн опнтхкъ            TETP', 2F10.3)
    IF(BET.EQ.0.) WRITE(1, 106) TETV
    106 FORMAT(
        *' сдекэмне яйнкэфемхе б мхфмеи цпюмхв-' /
        *' мни рнвйе ндмноюпмнцн гюжеокемхъ   TETV', 2F10.3 / )
    IF(BET.NE.0.) WRITE(1, 107) RLM, RLMIN, RKEPS
    107 FORMAT(/
        *' япедмъъ ясллюпмюъ дкхмю ' /
        *' йнмрюйрмшу кхмхи                     LM', F13.3 /
        *' мюхлемэьюъ ясллюпмюъ дкхмю ' /
        *' йнмрюйрмшу кхмхи                   LMIN', F13.3 /
        *' йнщттхжхемр япедмецн хглемемхъ ' /
        *' ясллюпмни дкхмш йнмрюйрмшу кхмхи   KEPS', F13.3 / )
    RETURN
    END
*/
